#!/usr/bin/python3

#  Написать программу, которая выводит строку Hello, world (в точности)
#  Input:
#
#  (ввод не нужен)
#
#  Output:
#
#  Hello, world

if __name__ == "__main__" :
    print ('Hello world')
